In [70]:
import numpy as np
import pandas as pd
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn import svm
from sklearn.metrics import accuracy_score

In [71]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [72]:
df1.head()

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male

In [73]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [74]:
df1.tail()

      Name  Marks  Gender
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [75]:
df1.shape

(7, 3)

In [76]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [77]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [78]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [79]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [80]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [81]:
len(df1['Gender'].unique())

2

In [82]:
df1['Gender'].nunique()

2

In [83]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [84]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [85]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]['Name']

0    Priyang
2     Krisha
4     Parshv
6    Archana
Name: Name, dtype: object

In [86]:
sum((df1['Marks']>=90) & (df1['Marks']<=100))

4

In [87]:
sum(df1['Marks'].between(90,100))

4

In [88]:
df1['Marks'].mean()

np.float64(92.14285714285714)

In [89]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [90]:
def marks(x):
    return x/2
df1['Half_Marks']=df1['Marks'].apply(marks)
df1
df1['Name'].apply(len)
df1['Marks'].apply(lambda x:x//2)
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [91]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [92]:
df1
df1.drop(['Male_Female','Half_Marks'],axis=1)
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [93]:
df1.columns
df1.index

RangeIndex(start=0, stop=7, step=1)

In [94]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender  Half_Marks  Male_Female
2   Krisha     99  Female        49.5            0
6  Archana     99  Female        49.5            0
0  Priyang     98    Male        49.0            1
4   Parshv     90    Male        45.0            1
1   Aadhya     89  Female        44.5            0
3   Vedant     87    Male        43.5            1
5   Mittal     83  Female        41.5            0

In [95]:
df1[df1['Gender']=='Female'][['Name','Marks']]
df1[df1['Gender'].str.contains('female',case=False)][['Name','Marks']]
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [96]:
classifier = svm.SVC(kernel='linear')

In [97]:
import pickle

In [98]:
filename = 'trained_model.sav'
pickle.dump(classifier, open(filename, 'wb'))

In [105]:
# loading the saved model
loaded_model = pickle.load(open('trained_model.sav', 'rb'))

In [106]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_Marks', 'Male_Female'], dtype='object')

In [108]:
print(df1.columns)

Index(['Name', 'Marks', 'Gender', 'Half_Marks', 'Male_Female'], dtype='object')